Revit 2027 API
BuiltInFailures.LoadFailures.AreaLoadNotOverlappingHost Property
 Area load is not overlapping with its entire distribution its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AreaLoadNotOverlappingHost { get; }
Public Shared ReadOnly Property AreaLoadNotOverlappingHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AreaLoadNotOverlappingHost {
	FailureDefinitionId^ get ();
}
static member AreaLoadNotOverlappingHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace